##

In [290]:
import pandas as pd
import numpy as np
import os

project_path = r'C:\Users\cneva\06-2024 Instacart Basket Analysis'
df_prods = pd.read_csv(os.path.join(project_path,'02 Data','Original Data', 'products.csv'))
df_ords = pd.read_csv(os.path.join(project_path,'02 Data','Prepared Data', 'orders_wrangled.csv'), index_col = 0)
df_dep = pd.read_csv(os.path.join(project_path, '02 Data','Prepared Data','departments_wrangled.csv'))

#### 4.5.1 Mixed-Type Data

In [155]:
# Create a dataframe
df_test = pd.DataFrame()

In [156]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [157]:
df_test

    mix
0     a
1     b
2     1
3  True

In [158]:
# Check for mixed tyeps
for col in df_test.columns.tolist():
    weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len(df_test[weird]) > 0:
        print(col)

mix

In [159]:
df_test['mix'] = df_test['mix'].astype('str')

In [160]:
df_test['mix'].dtype

dtype('O')

#### 4.5.2 Missing values

In [162]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [163]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [164]:
# Replace missing values with the mean:
# df['column with missings'].fillna(mean value, inplace=True)

# replace missing values with the median:
# df['column with missings'].fillna(median value, inplace=True)

In [165]:
# create new df with non missing rows
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

# Drop all missing values
# df_prods.dropna(inplace = True)

# Only drop missing valuse from a particular column
# df_prods.dropna(subset = [‘product_name’], inplace = True)
# inplace = True = overwrites original dataframe
# inplace = False = return a view of the changed dataframe

#### 4.5.3 Duplicates

In [167]:
# Look for full duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [168]:
df_prods_clean.shape

(49677, 5)

In [169]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()
df_prods_clean_no_dups.shape

(49672, 5)

In [170]:
# df_prods_clean_no_dups.to_csv(os.path.join(project_path, '02 Data', 'Prepared Data', 'products_clean.csv'))

### 4.5 Task

##### 2. Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

##### - order_number has a max number of 100 which may indicate that the data is for custoemrs with <= 100 orders
##### - order_dow has a min of 0 and max of 6 which represents the 7 days of the week
##### - order_hour_of_day has a min of 0 and max of 23 which represents the 24 hours of hte day
##### - days_since_prior_order has a max number of 30 which may indicate that the data is for customers who consistently place orders within 30 days

In [296]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

##### 3. Check for mixed-type data in your df_ords dataframe.

In [302]:
# for col in df_ords.columns.tolist():
#     weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
#     if len(df_ords[weird]) > 0:
#         print(col)

# Check if data framme has mixed data types within the same column. False = none
mixed_types_per_column = df_ords.apply(lambda x: len(x.apply(type).unique()) > 1)
print(mixed_types_per_column)

order_id                  False
user_id                   False
order_number              False
orders_day_of_week        False
order_hour_of_day         False
days_since_prior_order    False
dtype: bool

##### 4. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.
##### - There are no mixed-type columns

##### 5. Run a check for missing values in your df_ords dataframe.

In [311]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

##### 6. Address the missing values using an appropriate method.
##### - It looks like an empty value in the days_since_prior_order means that it is that user's first and only order since the number of observations where days_since_prior_order is missing is the same as the number of unique customers for that subset of data.

In [319]:
df_ords[df_ords['days_since_prior_order'].isna()]

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [327]:
len(df_ords['user_id'].unique())

206209

##### Another check to confirm is to see if all order_numbers are equal to 1

In [339]:
df_ords_empty = df_ords[df_ords['days_since_prior_order'].isna()]
df_ords_empty[df_ords_empty['order_number'] != 1]

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

##### Nothing should be done to the days_since_prior_order column as deleting / imputing values would altar the overal dataset drastically.  It would be prudent to add another column that might explain the emptys such as a first order flag.  This would alleviate any confusion if any other person were to do further consistency checks on this dataframe.

In [351]:
df_ords['first_order'] = df_ords['days_since_prior_order'].isna()
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

##### 7.  Run a check for duplicate values in your df_ords data.
##### - There are no duplicated values

In [353]:
df_ords[df_ords.duplicated()]

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_order]
Index: []

##### 8. Address the duplicates using an appropriate method.
##### - No full duplicates

##### 9. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [359]:
df_prods_clean_no_dups.to_csv(os.path.join(project_path, '02 Data', 'Prepared Data', 'products_clean.csv'))
df_ords.to_csv(os.path.join(project_path, '02 Data', 'Prepared Data', 'orders_clean.csv'))